<?php

return [
    'login' => [
        'username' => 'البريد الإلكتروني/اسم المستخدم',
        'email' => 'البريد الإلكتروني',
        'password' => 'كلمة المرور',
        'title' => 'تسجيل دخول المستخدم',
        'remember' => 'تذكرني؟',
        'login' => 'تسجيل الدخول',
        'placeholder' => [
            'username' => 'أدخل اسم المستخدم أو عنوان البريد الإلكتروني',
            'email' => 'أدخل عنوان بريدك الإلكتروني',
            'password' => 'أدخل كلمة المرور الخاصة بك',
        ],
        'success' => 'تم تسجيل الدخول بنجاح!',
        'fail' => 'خطأ في اسم المستخدم أو كلمة المرور.',
        'not_active' => 'حسابك لم يتم تنشيطه بعد!',
        'banned' => 'هذا الحساب محظور.',
        'logout_success' => 'تم تسجيل الخروج بنجاح!',
        'dont_have_account' => 'ليس لديك حساب في هذا النظام، يرجى التواصل مع المسؤول لمزيد من المعلومات!',
    ],
    'forgot_password' => [
        'title' => 'نسيت كلمة المرور',
        'message' => '<p>هل نسيت كلمة المرور الخاصة بك؟</p><p>يرجى إدخال حساب بريدك الإلكتروني. سيرسل النظام بريداً إلكترونياً مع رابط نشط لإعادة تعيين كلمة المرور الخاصة بك.</p>',
        'submit' => 'إرسال',
    ],
    'reset' => [
        'new_password' => 'كلمة المرور الجديدة',
        'password_confirmation' => 'تأكيد كلمة المرور الجديدة',
        'email' => 'البريد الإلكتروني',
        'title' => 'إعادة تعيين كلمة المرور الخاصة بك',
        'update' => 'تحديث',
        'wrong_token' => 'هذا الرابط غير صالح أو منتهي الصلاحية. يرجى محاولة استخدام نموذج إعادة التعيين مرة أخرى.',
        'user_not_found' => 'اسم المستخدم هذا غير موجود.',
        'success' => 'تم إعادة تعيين كلمة المرور بنجاح!',
        'fail' => 'الرمز غير صالح، انتهت صلاحية رابط إعادة تعيين كلمة المرور!',
        'reset' => [
            'title' => 'إعادة تعيين كلمة مرور البريد الإلكتروني',
        ],
        'send' => [
            'success' => 'تم إرسال بريد إلكتروني إلى حسابك. يرجى التحقق وإكمال هذا الإجراء.',
            'fail' => 'لا يمكن إرسال البريد الإلكتروني في هذا الوقت. يرجى المحاولة مرة أخرى لاحقاً.',
        ],
        'new-password' => 'كلمة المرور الجديدة',
        'placeholder' => [
            'new_password' => 'أدخل كلمة المرور الجديدة',
            'new_password_confirmation' => 'أكد كلمة المرور الجديدة',
        ],
    ],
    'email' => [
        'reminder' => [
            'title' => 'إعادة تعيين كلمة مرور البريد الإلكتروني',
        ],
    ],
    'password_confirmation' => 'تأكيد كلمة المرور',
    'failed' => 'فشل',
    'throttle' => 'تجاوز الحد',
    'not_member' => 'لست عضواً بعد؟',
    'register_now' => 'سجل الآن',
    'lost_your_password' => 'فقدت كلمة المرور الخاصة بك؟',
    'login_title' => 'لوحة الإدارة',
    'login_via_social' => 'تسجيل الدخول عبر الشبكات الاجتماعية',
    'back_to_login' => 'العودة إلى صفحة تسجيل الدخول',
    'sign_in_below' => 'سجل الدخول أدناه',
    'languages' => 'اللغات',
    'reset_password' => 'إعادة تعيين كلمة المرور',
    'settings' => [
        'email' => [
            'title' => 'ACL',
            'description' => 'إعدادات البريد الإلكتروني لـ ACL',
        ],
    ],
];
